Catalogs/бит_СтатусФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатусФизЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачислятьПоНорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНаСубсидии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроживаниеВДанныйМомент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатусФизЛица/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Элемент не может быть записан!";
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнен статус физ. лица.";
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
	КонецЕсли;
	Если Не ЭтоНовый() тогда
		Если  Наименование <> Ссылка.Наименование
			ИЛИ НачислятьПоНорме <> Ссылка.НачислятьПоНорме 
			ИЛИ ПроживаниеВДанныйМомент <> Ссылка.ПроживаниеВДанныйМомент
			ИЛИ ПравоНаЛьготы <> Ссылка.ПравоНаЛьготы
			ИЛИ ПравоНаСубсидии <> Ссылка.ПравоНаСубсидии
			Тогда
			МассивДокументов = КритерииОтбора.бит_ДокументыПоСтатусуФизЛица.Найти(Ссылка);
			ЕстьПроведенныеДокументы = Ложь;
			
			Для каждого Документ из МассивДокументов Цикл
				
				ЕстьПроведенныеДокументы = Документ.Проведен;
				
				Если ЕстьПроведенныеДокументы тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПроведенныеДокументы Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы, проведенные по статусу """ + Ссылка.Наименование + """.
				|Реквизиты ""Статус физ. лица"", ""Участвует в расчетах"", ""Право на льготы"", ""Право на субсидии"" не могут быть изменены.
				|Элемент не записан.");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
